NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509.h
/* Copyright (c) 2015 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */
#ifndef DRV_SX1509_H__
#define DRV_SX1509_H__

#include "drv_sx1509_bitfields.h"
#include "nrf_drv_twi.h"

#include <stdint.h>


/**@brief The sx1509 status codes.
 */
enum
{
    DRV_SX1509_STATUS_CODE_SUCCESS,      ///< Successfull.
    DRV_SX1509_STATUS_CODE_DISALLOWED,   ///< Disallowed.
    DRV_SX1509_STATUS_CODE_INVALID_PARAM,///< Invalid parameters.
    DRV_SX1509_STATUS_CODE_NOT_SUPPORTED ///< Not supported.
};


/**@brief The ccs811 configuration.
 */
typedef struct
{
    uint8_t                      twi_addr;
    nrf_drv_twi_t        const * p_twi_instance;  ///< The instance of TWI master to be used for transactions.
    nrf_drv_twi_config_t const * p_twi_cfg;       ///< The TWI configuration to use while the driver is enabled.
} drv_sx1509_cfg_t;


/**@brief Inits the sx1509 driver. */
void drv_sx1509_init(void);


/**@brief Opens the sx1509 driver according to the specified configuration.
 *
 * @param[in]   p_drv_sx1509_cfg Pointer to the driver configuration for the session to be opened.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_open(drv_sx1509_cfg_t const * const p_drv_sx1509_cfg);


/**@brief Gets the input buffer disable register of the sx1509 device.
 *
 * @param[in]   p_inputdisable A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_inpbufdisable_get(uint16_t *p_inputdisable);


/**@brief Modifies the input buffer disable register of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_inpbufdisable_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the long slew rate configuration of the sx1509 device.
 *
 * @param[in]   p_longslewrate A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_longslewrate_get(uint16_t *p_longslewrate);


/**@brief Modifies the long slew rate configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_longslewrate_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the low drive configuration of the sx1509 device.
 *
 * @param[in]   p_lowdrive A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_lowdrive_get(uint16_t *p_lowdrive);


/**@brief Modifies the low drive configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_lowdrive_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the pull-up enable configuration of the sx1509 device.
 *
 * @param[in]   p_pullup A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_pullup_get(uint16_t *p_pullup);


/**@brief Modifies the pull-up enable configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_pullup_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the pull-down enable configuration of the sx1509 device.
 *
 * @param[in]   p_pulldown A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_pulldown_get(uint16_t *p_pulldown);


/**@brief Modifies the pull-down enable configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_pulldown_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the open drain operation enable configuration of the sx1509 device.
 *
 * @param[in]   p_opendrain A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_opendrain_get(uint16_t *p_opendrain);


/**@brief Modifies the open drain operation enable configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_opendrain_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the polarity inversion enable status of the sx1509 device.
 *
 * @param[in]   p_polarity A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_polarity_get(uint16_t *p_polarity);


