NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509.h
/**@brief Modifies the polarity inversion enable status of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_polarity_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the pin direction configuration of the sx1509 device.
 *
 * @param[in]   p_dir A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_dir_get(uint16_t *p_dir);


/**@brief Modifies the pin direction configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_dir_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the data to be output to the output-configured IOs of the sx1509 device.
 *
 * @param[in]   p_data A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_data_get(uint16_t *p_data);


/**@brief Modifies the data to be output to the output-configured IOs of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_data_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the interrupt mask of the sx1509 device.
 *
 * @param[in]   p_interruptmask A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_interruptmask_get(uint16_t *p_interruptmask);


/**@brief Modifies the interrupt mask of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_interruptmask_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the edge sensitivity configuration of the sx1509 device.
 *
 * @param[in]   p_sense A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_sense_get(uint32_t *p_sense);


/**@brief Modifies the edge sensitivity configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @note Clear mask may overlap with set mask to make it easier to set new values for
 *       multi-bit fields (i.e. the clear mask will be applied first so that the set mask
 *       gets priority to override the clear mask).
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_sense_modify(uint32_t set_mask, uint32_t clr_mask);


/**@brief Gets the interrupt source status of the sx1509 device.
 *
 * @param[in]   p_interruptsource A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_interruptsource_get(uint16_t *p_interruptsource);


/**@brief Clears the interrupt source status of the sx1509 device.
 *
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified mask is empty. */
uint32_t drv_sx1509_interruptsource_clr(uint16_t clr_mask);


/**@brief Gets the event status of the sx1509 device.
 *
 * @param[in]   p_eventstatus A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_eventstatus_get(uint16_t *p_eventstatus);


/**@brief Modifies the event status of the sx1509 device.
 *
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified mask is empty. */
uint32_t drv_sx1509_eventstatus_clr(uint16_t clr_mask);


/**@brief Gets the level shifter configuration of the sx1509 device.
 *
 * @param[in]   p_levelshifter A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_levelshifter_get(uint16_t *p_levelshifter);


/**@brief Modifies the level shifter configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @note Clear mask may overlap with set mask to make it easier to set new values for
 *       multi-bit fields (i.e. the clear mask will be applied first so that the set mask
 *       gets priority to override the clear mask).
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_levelshifter_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the clock configuration of the sx1509 device.
 *
 * @param[in]   p_clock A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_clock_get(uint8_t *p_clock);


