NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509.h
/**@brief Modifies the clock configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @note Clear mask may overlap with set mask to make it easier to set new values for
 *       multi-bit fields (i.e. the clear mask will be applied first so that the set mask
 *       gets priority to override the clear mask).
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_clock_modify(uint8_t set_mask, uint8_t clr_mask);


/**@brief Gets the miscellaneous configuration of the sx1509 device.
 *
 * @param[in]   p_misc A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_misc_get(uint8_t *p_misc);


/**@brief Modifies the miscellaneous configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_misc_modify(uint8_t set_mask, uint8_t clr_mask);


/**@brief Gets the LED driver enable configuration of the sx1509 device.
 *
 * @param[in]   p_leddriverenable A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_leddriverenable_get(uint16_t *p_leddriverenable);


/**@brief Modifies the LED driver enable configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_leddriverenable_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the debounce configruation of the sx1509 device.
 *
 * @param[in]   p_debounceconfig A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_debounceconfig_get(uint8_t *p_debounceconfig);


/**@brief Modifies the debounce configruation of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_debounceconfig_modify(uint8_t set_mask, uint8_t clr_mask);


/**@brief Gets the debounce enable configuration of the sx1509 device.
 *
 * @param[in]   p_debounceenable A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_debounceenable_get(uint16_t *p_debounceenable);


/**@brief Modifies the debounce enable configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_debounceenable_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the key configuration of the sx1509 device.
 *
 * @param[in]   p_keyconfig A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_keyconfig_get(uint16_t *p_keyconfig);


/**@brief Modifies the key configuration of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_keyconfig_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the key data status of the sx1509 device.
 *
 * @note The keydata value is intentionally of oposite polarity than HW to work in the same
 *       way as the InterruptSource and EventStatus registers (i.e. active high interrupts).
 *
 * @param[in]   p_keydata A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_keydata_get(uint16_t *p_keydata);


/**@brief Gets the the on/off time and intensity configuration (RegTOn15, RegIOnX & RegOffX registers) of the sx1509 device.
 *
 * @param[in]   pin_no      The pin number to configure.
 * @param[in]   p_onoffcfgx A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_onoffcfgx_get(uint8_t pin_no, uint32_t *p_onoffcfgx);


/**@brief Modifies the on/off time and intensity configuration (RegTOn15, RegIOnX & RegOffX registers) of the sx1509 device.
 *
 * @param[in]   pin_no      The pin number to configure.
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @note Clear mask may overlap with set mask to make it easier to set new values for
 *       multi-bit fields (i.e. the clear mask will be applied first so that the set mask
 *       gets priority to override the clear mask).
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     Invalid pin number, or masks specify unused bits. */
uint32_t drv_sx1509_onoffcfgx_modify(uint8_t pin_no, uint32_t set_mask, uint32_t clr_mask);


