NordicPlayground/nrf528xx-ble-throughput-demo/display_shield_files/inc/drv_sx1509.h
/**@brief Gets the fade in/out configuration (RegTRiseX & RegTFallX registers) of the sx1509 device.
 *
 * @param[in]   pin_no         The pin number to configure.
 * @param[in]   p_risefallcfgx A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_risefallcfgx_get(uint8_t pin_no,uint16_t *p_risefallcfgx);


/**@brief Modifies the fade in/out configuration (RegTRiseX & RegTFallX registers) of the sx1509 device.
 *
 * @param[in]   pin_no      The pin number to configure.
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @note Clear mask may overlap with set mask to make it easier to set new values for
 *       multi-bit fields (i.e. the clear mask will be applied first so that the set mask
 *       gets priority to override the clear mask).
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     Invalid pin number, or masks specify unused bits. */
uint32_t drv_sx1509_risefallcfgx_modify(uint8_t pin_no, uint16_t set_mask, uint16_t clr_mask);


/**@brief Gets the enable configuration for high-voltage input mode of the sx1509 device.
 *
 * @param[in]   p_highinpmode A pointer to where the value is to be stored.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_highinpmode_get(uint16_t *p_highinpmode);


/**@brief Modifies the enable configuration for high-voltage input mode of the sx1509 device.
 *
 * @param[in]   set_mask    A mask specifying what bits to set.
 * @param[in]   clr_mask    A mask specifying what bits to clear.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time.
 * @return DRV_SX1509_STATUS_INVALID_PARAM     If specified masks overlaps. */
uint32_t drv_sx1509_highinpmode_modify(uint16_t set_mask, uint16_t clr_mask);


/**@brief Resets the sx1509 device.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_reset(void);


/**@brief Closes the sx1509 driver.
 *
 * @return DRV_SX1509_STATUS_CODE_SUCCESS      If the call was successful.
 * @return DRV_SX1509_STATUS_CODE_DISALLOWED   If the call was not allowed at this time. */
uint32_t drv_sx1509_close(void);

#endif // DRV_SX1509_H__
